T5/app/controllers/documents_controller.rb

INSERT INTO "documents" ("number", "emission", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 1234], ["emission", "20/06/2023"], ["player_id", 1], ["created_at", "2023-06-22 05:59:58.272201"], ["updated_at", "2023-06-22 05:59:58.272201"]]
---
  def create
    @document = Document.new(document_params)

    respond_to do |format|
      if @document.save