T5/app/controllers/players_controller.rb

INSERT INTO "players" ("name", "age", "career_time", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "João"], ["age", 23], ["career_time", 3], ["team_id", 1], ["created_at", "2023-06-22 05:44:20.657213"], ["updated_at", "2023-06-22 05:44:20.657213"]]
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save

UPDATE "players" SET "career_time" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["career_time", 4], ["updated_at", "2023-06-22 06:48:34.063649"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @player.update(player_params)

DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
---
  def destroy
    @player.destroy