T5/app/controllers/teams_controller.rb

INSERT INTO "teams" ("name", "num_titles", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Barcelona"], ["num_titles", 12], ["created_at", "2023-06-22 05:44:08.377137"], ["updated_at", "2023-06-22 05:44:08.377137"]]
---
  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save

UPDATE "teams" SET "num_titles" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["num_titles", 13], ["updated_at", "2023-06-22 06:51:13.587526"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @team.update(team_params)