T5/app/controllers/tournaments_controller.rb

  def index
    @tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def create
    @tournament = Tournament.new(tournament_params)

    respond_to do |format|
      if @tournament.save
---
INSERT INTO "tournaments" ("name", "country", "foundation_year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "La Liga"], ["country", "Espanha"], ["foundation_year", 1960], ["created_at", "2023-06-22 06:04:09.140556"], ["updated_at", "2023-06-22 06:04:09.140556"]]

  def destroy
    @tournament.destroy
---
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 1]]

    def set_tournament
      @tournament = Tournament.find(params[:id])
---
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]